read_verilog sumador.v

proc; opt; memory; opt; fsm; opt;

techmap; opt;

dfflibmap -liberty cmos_cells.lib

abc -liberty cmos_cells.lib

clean

write_verilog sumador_synth.v