read_verilog Mux4x1.v 
hierarchy -check -top Mux4x1 
proc; opt; fsm; opt; memory; opt;
techmap; opt
dfflibmap -liberty cmos_cells.lib
abc -liberty cmos_cells.lib
show Mux2x1_4b
write_verilog Mux4x1synth.v
